{
  "backend/main.mo": "Defines the main actor with user profiles, personal accounts, payments, platform connections, currencies, and transactions, including access control and comparison helpers.",
  "backend/migration.mo": "Implements a migration that adds password and NID fields to PersonalAccount by transforming stored records.",
  "feature_evidence.json": "Lists features, related files, components, and test IDs documenting password and NID updates to PersonalAccount and UI validation requirements.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files, covering styling, routing, hooks, components, and pages.",
  "frontend/index.css": "Defines base Tailwind layers and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React entry point.",
  "frontend/src/App.tsx": "Sets up the TanStack router, routes, theme provider, and global toast notifications.",
  "frontend/src/components/auth/AuthStatus.tsx": "Shows authenticated user info with dropdown options for personal account navigation and logout.",
  "frontend/src/components/brand/ShanjuLogo.tsx": "Renders the Shanju logo with a fallback text badge if the image fails to load.",
  "frontend/src/components/integrations/ConnectorCreateForm.tsx": "Form for creating platform connectors with validation, API submission, and toast feedback.",
  "frontend/src/components/integrations/ConnectorsTable.tsx": "Displays a list of connectors with platform labels and allows deleting connectors via confirmation dialog.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the top navigation header with the brand logo and authentication status.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with route protection, header, navigation bar, and content outlet.",
  "frontend/src/components/payments/CreditCardForm.tsx": "Implements a credit card payment form with validation and simulated processing.",
  "frontend/src/components/payments/PaymentDetailsCard.tsx": "Displays payment details, status, role info, and allows status updates and sharing the payment link.",
  "frontend/src/components/payments/PaymentForm.tsx": "Form for creating a new payment request with validation and submission handling.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Renders two buttons for selecting card or PayPal payments and calls onSelect with the chosen method.",
  "frontend/src/components/payments/PaymentsTable.tsx": "Displays a filterable table of payments with status badges, role calculation, and navigation actions.",
  "frontend/src/components/payments/PaymentStatusBadge.tsx": "Shows a badge with label and style based on a payment status value.",
  "frontend/src/components/payments/PayPalButton.tsx": "Shows a PayPal payment option that simulates redirect and completion.",
  "frontend/src/components/payments/SimpleCaptcha.tsx": "Generates a simple text-based CAPTCHA and verifies user input before proceeding.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for entering and saving a user’s name during initial profile setup.",
  "frontend/src/components/wallet/AddMoneyForm.tsx": "Form for funding a wallet using card or bank methods with validation and mutation submission.",
  "frontend/src/components/wallet/CashOutForm.tsx": "Form for withdrawing funds to various external providers with validation and mutation handling.",
  "frontend/src/components/wallet/SendMoneyForm.tsx": "Form for sending money to another principal with validation and transfer submission.",
  "frontend/src/components/wallet/WalletBalancesCard.tsx": "Displays the user's wallet balances with loading skeletons and formatted currency output.",
  "frontend/src/components/wallet/WalletHistoryTable.tsx": "Renders the user's transaction history with icons, status badges, and sorted timestamps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useConnectors.ts": "Provides hooks to list, fetch, create, update, and delete platform connectors using the actor.",
  "frontend/src/hooks/useCurrentPrincipal.ts": "Returns the authenticated user's non-anonymous principal or null.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, login flow, stored identities, and context access.",
  "frontend/src/hooks/usePayments.ts": "Offers hooks to list, fetch, create, and update user payments via the backend actor.",
  "frontend/src/hooks/usePersonalAccount.ts": "Handles fetching and saving the caller's personal account data with helpers for normalization.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to get and save the caller's user profile through the backend actor.",
  "frontend/src/hooks/useWallet.ts": "Provides React Query hooks for wallet balance, transaction history, and mutations for internal transfers, adding money, and cashing out. Includes error handling and invalidation of related queries.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light and dark modes with a warm color palette. Applies base styling including global font and border utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers. Imports global CSS and renders the main App component.",
  "frontend/src/pages/CreatePaymentPage.tsx": "Displays a form for creating a new payment request. Provides a simple layout with title and PaymentForm component.",
  "frontend/src/pages/DashboardPage.tsx": "Shows payment statistics, profile setup alerts, and payments table after loading user account data. Provides navigation shortcuts to create payments and edit personal account.",
  "frontend/src/pages/IntegrationsPage.tsx": "Allows users to create and manage e-commerce integrations. Displays forms and tables for connectors within styled cards.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a 404 page with navigation back to dashboard or sign-in depending on authentication. Uses styled card UI for error messaging.",
  "frontend/src/pages/PaymentDetailsPage.tsx": "Loads and displays details for a single payment based on URL ID. Handles loading, errors, and provides navigation back to the dashboard.",
  "frontend/src/pages/PaymentHistoryPage.tsx": "Shows a full table of all payment requests. Provides a simple header and embeds the PaymentsTable component.",
  "frontend/src/pages/PersonalAccountPage.tsx": "Manages viewing and editing of the user's personal account with form validation and save operations. Includes wallet balances, history, and money transfer forms.",
  "frontend/src/pages/PublicPaymentPage.tsx": "Public-facing payment page allowing users to complete a payment via card or PayPal with captcha verification. Handles payment status display, completion flow, and invalid or unavailable links.",
  "frontend/src/pages/SignInPage.tsx": "Sign-in page that triggers Internet Identity login, handles errors, and redirects authenticated users; shows profile setup modal when needed.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint amounts in cents into currency strings using Intl.NumberFormat with a fallback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/walletCurrency.ts": "Converts backend currency variants to codes/labels and formats or parses amounts between display and smallest units.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme settings, custom colors, animations, and plugins.",
  "project_state.json": "Project state file describing existing features, new feature requests, and metadata for the Password and NID requirement project."
}