{
  "backend/main.mo": "Motoko canister implementing user profiles, payments with multi-currency support, access control, and platform connector storage.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark mode variables for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global toaster for the React app.",
  "frontend/src/components/auth/AuthStatus.tsx": "Authenticated user dropdown showing profile info and sign‑out with cache clearing.",
  "frontend/src/components/brand/ShanjuLogo.tsx": "Shanju logo component with fallback initials when the image fails to load.",
  "frontend/src/components/integrations/ConnectorCreateForm.tsx": "Form for creating platform connectors with validation, submission, and toast feedback.",
  "frontend/src/components/integrations/ConnectorsTable.tsx": "Table listing connectors with platform labels and delete confirmation dialog.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the sticky top header with logo, app title, and authentication status.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with auth-protected routes, header, navigation bar, content outlet, and footer.",
  "frontend/src/components/payments/CreditCardForm.tsx": "Implements a credit card payment form with validation, formatted inputs, and simulated processing.",
  "frontend/src/components/payments/PaymentDetailsCard.tsx": "Displays detailed payment info with status, role, link sharing, and status update actions.",
  "frontend/src/components/payments/PaymentForm.tsx": "Form for creating a new payment request with validation and backend submission.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "Allows the user to choose between card or PayPal as the payment method.",
  "frontend/src/components/payments/PaymentsTable.tsx": "Displays a payments list with filtering, role detection, loading/error states, and navigation actions.",
  "frontend/src/components/payments/PaymentStatusBadge.tsx": "Shows a styled badge indicating the current payment status.",
  "frontend/src/components/payments/PayPalButton.tsx": "Provides a PayPal payment UI that simulates redirect and processing before triggering success.",
  "frontend/src/components/payments/SimpleCaptcha.tsx": "Renders a basic CAPTCHA generator and validator to confirm human input before proceeding.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal that collects and saves a user's name during initial profile setup using a form.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useConnectors.ts": "Provides hooks to list, fetch, create, update, and delete platform connector records via the actor.",
  "frontend/src/hooks/useCurrentPrincipal.ts": "Returns the authenticated user's principal or null if unauthenticated or anonymous.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via context.",
  "frontend/src/hooks/usePayments.ts": "Hooks for listing, fetching, creating, and updating payments using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the current user's profile with query invalidation.",
  "frontend/src/index.css": "Tailwind base styles and a warm theme palette for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/CreatePaymentPage.tsx": "Renders a page with a header and the PaymentForm to create a new payment request.",
  "frontend/src/pages/DashboardPage.tsx": "Displays payment stats, a create button, and a table of payments using fetched payment data.",
  "frontend/src/pages/IntegrationsPage.tsx": "Provides UI to add new commerce integrations and manage existing connectors.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 message with a button navigating users back to sign‑in or the dashboard.",
  "frontend/src/pages/PaymentDetailsPage.tsx": "Loads a payment by index, showing its details or fallback states such as loading or not found.",
  "frontend/src/pages/PaymentHistoryPage.tsx": "Shows a simple page header and the full payments table for history viewing.",
  "frontend/src/pages/PublicPaymentPage.tsx": "Public-facing payment flow that verifies captcha, selects methods, and processes payments with status handling.",
  "frontend/src/pages/SignInPage.tsx": "Handles Internet Identity login, displays errors, and triggers profile setup or redirects to the dashboard.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint currency amounts using Intl.NumberFormat with a fallback.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Custom Tailwind configuration defining colors, fonts, themes, and animations with plugins.",
  "project_state.json": "Defines project state including schema version, architectural plans, existing features, and requirements for the Shanju payment provider app. Captures integrations, multi‑currency, hosted checkout, and connector management details."
}