{
  "backend/main.mo": "Defines actor with user profiles, accounts, payments, transactions, OTP data, and related types and maps for the backend logic.",
  "feature_evidence.json": "Lists implemented features with linked files, components, tests, and confidence metadata for project auditing.",
  "frontend-file-summaries.txt": "Provides short descriptions of many frontend source files for reference or build planning.",
  "frontend/index.css": "Tailwind base file defining OKLCH design tokens for light and dark themes and global background/foreground styles.",
  "frontend/index.html": "Main HTML entry point loading the web app root and manifest with Shanju branding metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest configured for the Shanju Admin Panel with start_url /admin, icons, and an admin shortcut.",
  "frontend/public/sw.js": "Service worker implementing caching, SPA navigation support, and app shell fallback for offline handling.",
  "frontend/src/App.tsx": "Configures the TanStack router, page routes, theme provider, service worker hook, and root application structure.",
  "frontend/src/components/admin/AdminPaymentsTable.tsx": "Admin payments table fetching all payments and displaying them with status, amounts, and payer/payee info.",
  "frontend/src/components/admin/AdminUserLookup.tsx": "Searches for a user by principal ID and displays profile and account details with loading and error states.",
  "frontend/src/components/admin/AndroidInstallGuideCard.tsx": "Shows Android PWA installation status and instructions with an option to trigger installation.",
  "frontend/src/components/auth/AuthStatus.tsx": "Displays authenticated user info with a dropdown for account, admin panel access, and sign‑out.",
  "frontend/src/components/brand/ShanjuLogo.tsx": "Renders the Shanju logo image with a fallback text logo on load error.",
  "frontend/src/components/integrations/ConnectorCreateForm.tsx": "Form to create a new connector by entering platform, name, API key, and secret, with validation and submission.",
  "frontend/src/components/integrations/ConnectorsTable.tsx": "Lists existing connectors with platform labels and supports deleting a selected connector.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header showing the logo and authentication status.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, auth‑protected navigation, routed content, and footer.",
  "frontend/src/components/payments/CreditCardForm.tsx": "Implements a credit card payment form with input validation, formatting, and simulated processing before calling success.",
  "frontend/src/components/payments/PaymentDetailsCard.tsx": "Displays full payment details, role info, and allows status updates, link copying, and opening pending payment links.",
  "frontend/src/components/payments/PaymentForm.tsx": "Form for creating a new payment request with validation and submission via createPayment hook.",
  "frontend/src/components/payments/PaymentMethodSelector.tsx": "UI for selecting between card or PayPal payment methods.",
  "frontend/src/components/payments/PaymentsTable.tsx": "Lists payments with filters, roles, statuses, and navigation to individual payment details.",
  "frontend/src/components/payments/PaymentStatusBadge.tsx": "Renders a badge showing a payment’s status with corresponding variant styles.",
  "frontend/src/components/payments/PayPalButton.tsx": "Provides a PayPal payment button that simulates redirect and completion before triggering success.",
  "frontend/src/components/payments/SimpleCaptcha.tsx": "Simple text‑based CAPTCHA component that generates codes and verifies user input.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal component that collects a user's name and saves their profile using a mutation with basic validation and toast notifications.",
  "frontend/src/components/wallet/AddMoneyForm.tsx": "Form for initiating add‑money requests supporting card and bank methods, performing validation, and triggering OTP verification workflow.",
  "frontend/src/components/wallet/AddMoneyOtpDialog.tsx": "Dialog for entering and verifying a 6‑digit OTP for add‑money transactions, with resend support and error handling.",
  "frontend/src/components/wallet/CashOutForm.tsx": "Form for submitting cash‑out requests with validation, provider selection, and conversion of amounts to smallest units.",
  "frontend/src/components/wallet/SendMoneyForm.tsx": "Form that sends money to another user via phone number with validation, currency handling, and mutation submission.",
  "frontend/src/components/wallet/WalletBalancesCard.tsx": "Card that fetches and displays the user's wallet balances across currencies, showing skeletons during loading.",
  "frontend/src/components/wallet/WalletHistoryTable.tsx": "Renders a wallet transaction history table with icons, labels, status badges, and sorting, using data from useGetCallerTransactionHistory.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides a hook to check if the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useAdminPanel.ts": "Exposes admin-focused queries for listing payments, users, and fetching detailed user account data.",
  "frontend/src/hooks/useConnectors.ts": "Provides CRUD hooks for managing platform connectors through the backend actor with react-query caching.",
  "frontend/src/hooks/useCurrentPrincipal.ts": "Returns the authenticated user's Principal or null if unauthenticated or anonymous.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity persistence, and exposing identity state.",
  "frontend/src/hooks/usePayments.ts": "Hooks for listing, retrieving, creating, and updating payments for the authenticated user.",
  "frontend/src/hooks/usePersonalAccount.ts": "Provides hooks to fetch and save the caller’s personal account along with helpers to normalize account data.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Manages PWA install prompt events and exposes installability and installation state.",
  "frontend/src/hooks/useServiceWorker.ts": "Registers the service worker on mount and logs success or failure.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for loading and updating the caller’s user profile via the backend actor.",
  "frontend/src/hooks/useWallet.ts": "Provides React Query hooks for wallet balance, transaction history, and internal transfers with toast-based error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin panel with access control and tabs for payments, user lookup, and install guides.",
  "frontend/src/pages/CreatePaymentPage.tsx": "Displays a simple page containing the payment creation form.",
  "frontend/src/pages/DashboardPage.tsx": "Shows payment stats, account prompts, and a table of payments after loading personal account data.",
  "frontend/src/pages/IntegrationsPage.tsx": "Provides UI for adding and managing e‑commerce platform integrations.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page that redirects users back to dashboard or sign‑in depending on authentication.",
  "frontend/src/pages/PaymentDetailsPage.tsx": "Loads a payment by index from the list and displays detailed information or fallback messages.",
  "frontend/src/pages/PaymentHistoryPage.tsx": "Shows a full table of the user's payment history.",
  "frontend/src/pages/PersonalAccountPage.tsx": "Manages personal account creation and editing with validation, tabs, and wallet tools.",
  "frontend/src/pages/PublicPaymentPage.tsx": "Renders the public payment page with loading, invalid, completed, and pending payment states, allowing users to select a method and complete a payment.",
  "frontend/src/pages/SignInPage.tsx": "Displays the Internet Identity sign‑in flow and redirects authenticated users to the dashboard, optionally showing a profile setup modal.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint currency amounts into localized strings using Intl.NumberFormat with a fallback formatter.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash‑based routing values.",
  "frontend/src/utils/walletCurrency.ts": "Converts backend currency variants to codes/labels and handles formatting and parsing of wallet amounts across fiat and crypto types.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for typography, container queries, and animated UI.",
  "project_state.json": "Describes the project’s PWA‑focused goals, features, and requirements for making the admin panel installable and app‑like on mobile."
}