{
  "kind": "build_request",
  "title": "Make the Admin Panel installable as a focused PWA experience (Android Add to Home Screen)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the PWA manifest so installing from the Admin Panel provides an admin-focused install experience: set the manifest `start_url` to `/admin` and add a shortcut entry for the Admin Panel route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "হ্যা"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/public/manifest.webmanifest` has `start_url` set to `/admin`.",
        "The manifest includes a shortcut for the `/admin` route (and uses existing app icons where appropriate).",
        "Installing the app from Android Chrome and launching it opens directly into `/admin` (then follows the existing auth/admin gating behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the service worker supports SPA navigation for the installed PWA so deep links like `/admin`, `/dashboard`, and `/pay/<id>` reliably load when opened from the home screen (no blank page / network error due to missing cache or navigation handling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "হ্যা"
        ]
      },
      "acceptanceCriteria": [
        "When the app is installed and opened at `/admin`, it loads successfully and renders the React app shell.",
        "Direct navigation to `/dashboard` and `/pay/<id>` works in standalone mode without returning a non-app HTML error.",
        "Service worker changes do not break existing caching behavior for static assets and icons."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust the Admin Panel install guide UI copy so it explicitly communicates that the Admin Panel can be installed and used app-like via “Add to Home Screen” (English only), and include a brief note that this is the supported alternative to an APK.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "হ্যা"
        ]
      },
      "acceptanceCriteria": [
        "Admin Panel > Install Guide tab text is clear, concise, and fully in English.",
        "Copy mentions “Add to Home Screen/Install app” as the APK-like installation method for Android.",
        "No new authentication or backend changes are introduced as part of copy updates."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in the build request deliverables.",
    "Do not edit any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui`."
  ],
  "nonGoals": [
    "Generating an Android APK or publishing to the Play Store.",
    "Adding third-party mobile wrappers (Capacitor/Cordova) or native Android code.",
    "Implementing real-time admin updates or push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}