{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Panel focused PWA install + SPA-friendly service worker navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the installed PWA launch into the Admin Panel and expose an Admin Panel shortcut in the manifest.",
      "acceptanceCriteria": [
        "`frontend/public/manifest.webmanifest` has `start_url` set to `/admin`.",
        "The manifest includes a shortcut for the `/admin` route (and uses existing app icons where appropriate).",
        "Installing the app from Android Chrome and launching it opens directly into `/admin` (then follows the existing auth/admin gating behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update the PWA manifest to set `start_url` to `/admin` and add a `shortcuts` entry pointing to `/admin`, reusing existing generated icons already listed in the manifest."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the service worker to handle SPA navigations so deep links load reliably in standalone mode.",
      "acceptanceCriteria": [
        "When the app is installed and opened at `/admin`, it loads successfully and renders the React app shell.",
        "Direct navigation to `/dashboard` and `/pay/<id>` works in standalone mode without returning a non-app HTML error.",
        "Service worker changes do not break existing caching behavior for static assets and icons."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Adjust fetch handling to support SPA navigation by serving the cached app shell for same-origin navigation requests (e.g., `/admin`, `/dashboard`, `/pay/<id>`) when the network response is missing/unsuitable, while preserving existing static asset/icon caching behavior."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Revise the Admin Panel Install Guide copy to clearly explain Add to Home Screen as the supported APK alternative (English only).",
      "acceptanceCriteria": [
        "Admin Panel > Install Guide tab text is clear, concise, and fully in English.",
        "Copy mentions “Add to Home Screen/Install app” as the APK-like installation method for Android.",
        "No new authentication or backend changes are introduced as part of copy updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AndroidInstallGuideCard.tsx",
          "operation": "modify",
          "description": "Update user-facing text to be explicitly Admin Panel-focused, clearly instruct Android users to use “Add to Home Screen/Install app” for an app-like install experience, and add a brief note that this is the supported alternative to an APK (English only)."
        }
      ]
    }
  ]
}